Repository: BlackIQ/coffee-roaster-mobile
Catalog: lib/src/l10n/app_*.arb
Languages: fa

# app_title
source: Roaster
fa: رستر

# tab_settings_lang
source: Language
fa: زبان

# tab_settings_theme
source: Theme
fa: تم

# page_scan_title
source: Scan devices
fa: انتخاب دستگاه

# page_scan_no_device
source: No device founded
fa: دستگاهی پیدا نشد

# page_settings_language_title
source: Change language
fa: تغییر زبان

# page_settings_title_title
source: Change theme
fa: تغییر تم

# ble_button_connect
source: Connect
fa: اتصال

# ble_button_disconnect
source: Disonnect
fa: قطع اتصال

# bean_robusta
source: Robusta
fa: ربوستا

# bean_arabica
source: Arabica
fa: عربیکا

# bean_test
source: Test
fa: تست

# bottom_navigator_roaster
source: Roast
fa: رستر

# bottom_navigator_settings
source: Settings
fa: تنظیمات

# bottom_navigator_history
source: History
fa: تاریخچه

# toast_no_device
source: Please connect to a device first
fa: ابتدا به یک دستگاه متصل شوید

# toast_start_operation
source: Operation started
fa: عملیات آغاز شد

# dialog_roast_yes
source: Start
fa: شروع

# dialog_roast_no
source: Maybe later
fa: شاید بعدا

# settings_language_title
source: Change language
fa: تغییر زبان

# settings_language_details
source: Select the language you are more comfortable with
fa: زبانی را که با آن راحت ترید را انتخاب کنید

# settings_theme_title
source: Change mode
fa: تغییر تم

# settings_theme_details
source: Here you can modify your app theme
fa: اینجا میتوانید تم اپ را تغییر دهید

# settings_color_title
source: Change theme color
fa: تغییر رنگ

# settings_color_details
source: Here you can customize your app more!
fa: برای شخصی سازی بیشتر، میتوانید رنگ اصلی برنامه را تغییر دهید

# settings_color_bottom
source: Browse colors
fa: مرور رنگ‌ها

# theme_light
source: Light theme
fa: تم روشن

# theme_dark
source: Dark theme
fa: تم تاریک

# roast_duration
source: Duration: {duration}
fa: مدت زمان: {duration}

# dialog_roast_title
source: Roasting {title}
fa: سرخ کردن {title}

# dialog_roast_content
source: Do you confirm you want to roat your {title} for {duration} minutes?
fa: آیا تایید میکنید که {title} به مدت {duration} دقیقه سرخ شود؟?

# color_number
source: Color {index}
fa: رنگ {index}

# step_title_type
source: Type
fa: نوع

# step_title_bean
source: Bean
fa: نوع قهوه

# step_title_roast
source: Roast
fa: نوع رست

# step_title_weight
source: Weigth
fa: وزن قهوه

# step_title_size
source: Size
fa: سایز قهوه

# step_title_country
source: Country
fa: کشور

# step_details_type
source: Select type
fa: نوع را انتخاب کنید

# step_details_bean
source: Select bean
fa: نوع قهوه را انتخاب کنید

# step_details_roast
source: Select roast
fa: نوع رست را انتخاب کنید

# step_details_weight
source: Select weight
fa: وزن قهوه را انتخاب کنید

# step_details_size
source: Select size
fa: سایز قهوه را انتخاب کنید

# step_details_ciuntry
source: Select country
fa: کشور را انتخاب کنید

# step_types_easy
source: Easy
fa: آسان

# step_types_advanced
source: Advanced
fa: پیشرفته

# step_beans_a
source: Arabica
fa: عربیکا

# step_beans_r
source: Robusta
fa: روبوستا

# step_roast_light
source: Light
fa: لایت

# step_roast_medium
source: Medium
fa: مدیوم

# step_roast_dark
source: Dark
fa: دارک

# step_size_coarse
source: Coarse
fa: درشت

# step_size_medium
source: Medium
fa: متوسط

# step_size_tiny
source: Tiny
fa: ریز

# country_vietnam
source: Vietnam
fa: ویتنام

# country_brazil
source: Brazil
fa: برزیل

# country_indonesia
source: Indonesia
fa: اندونزی

# country_india
source: India
fa: هند

# country_ethiopia
source: Ethiopia
fa: اتیوپی

# country_columbia
source: Columbia
fa: کلمبیا

# country_guatemala
source: Guatemala
fa: گواتمالا

# country_costarica
source: Costa Rica
fa: کاستاریکا

# country_etc
source: Etc
fa: غیره

# confirm_continue
source: Would you like to continue?
fa: آیا مایل به ادامه هستید؟

# step_trns
source: Step
fa: قدم

# login_title
source: Login to your account
fa: وارد حساب خود شوید

# email_label
source: email
fa: ایمیل

# email_placeholder
source: Enter your email
fa: ایمیل خود را وارد نمایید

# password_label
source: Password
fa: رمز

# password_placeholder
source: Enter your password
fa: رمز عبور خود را وارد نمایید

# button_login
source: Login
fa: ورود به حساب کاربری

# button_register
source: Register
fa: ثبت‌نام

# button_change_login
source: I have account
fa: حساب دارم

# button_change_register
source: I don't have account
fa: ساخت حساب جدید

# button_guest
source: Login as guest
fa: ورود به عنوان مهمان

# tab_settings_logout
source: Logout from account
fa: خروج از حساب کاربری

# tab_settings_profile
source: Profile
fa: حساب کاربری

# tab_settings_support
source: Support
fa: پشتیبانی

# tooltip_disconnected
source: No active connection
fa: اتصال فعالی یافت نشد

# tooltip_connected
source: Connected to {name}
fa: متصل به {name}

# action_connected
source: Connected to {name}
fa: به {name} متصل شدید

# action_disconnected
source: Dosconnected from {name}
fa: از {name} قطع شدید

# page_support_title
source: Support
fa: پشتیبانی

# page_support_add_tooltip
source: Create new ticket
fa: ارسال تیکت جدید

source: Loading
fa: درحال بارگیری

# issued_ticket
source: Ticket issued at
fa: تاریخ ثبت تیکت

# rate_title
source: Rate this support
fa: به پشتیبانی امتیاز دهید

# rate_before
source: You rated this ticket before!
fa: شما قبلا روی این پشتیبانی امتیاز ثبت کرده اید!

# rate_done
source: Rated successfully
fa: امتیاز با موفقیت ثبت شد

# rate_submit
source: Rate
fa: ثبت امتیاز

# page_support_add_title
source: Create new ticket
fa: درخواست جدید

# page_support_add_details
source: Here you can create new support request.
fa: در اینجا میتوانید درخواست جدید خود را ثبت کنید تا پشتیبان های ما در اصرع وقت به درخواست شما رسیدگی کنند.

# page_support_field_title
source: Enter title
fa: موضوع درخواست

# page_support_field_details
source: Enter details
fa: توضیحات درخواست

# page_support_button_submit
source: Send ticket
fa: ارسال درخواست

# page_support_snack_created
source: Sent!
fa: درخواست شما ارسال شد

# page_settings_profile
source: Profle
fa: پروفایل

# page_settings_profile_change_info
source: Change information
fa: تغییر اطلاعات فردی

# page_settings_profile_change_password
source: Change password
fa: تغییر رمز

# page_settings_profile_field_name
source: Enter name
fa: نام را وارد کنید

# page_settings_profile_field_email
source: Enter email
fa: ایمیل را وارد کنید

# page_settings_profile_field_currentpass
source: Current password
fa: رمز فعلی

# page_settings_profile_field_newpassword
source: New password
fa: رمز جدید

# page_settings_profile_field_confirmpassword
source: Confirm password
fa: تایید رمز جدید

# page_settings_profile_submit_info
source: Change information
fa: تغییر اطلاعات

# page_settings_profile_submit_password
source: Change password
fa: تغییر رمز

# page_settings_profile_pass_updated
source: Password updated
fa: رمز با موفقیت تغییر کرد

# page_settings_profile_pass_conflict_current
source: Current password is not matched
fa: رمز فعلی با رمز وارد شده مقایرت دارد

# page_settings_profile_pass_conflict_new
source: New password and confirm password is not matched
fa: رمز جدید با تایید رمز مقایرت دارد

# page_settings_profile_user_updated
source: User updated
fa: اطلاعات با موفقیت تغییر کرد
